{"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_1", "sparse": false, "input_dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "lambda_1", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "trainable": true, "arguments": {}}, "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "block1_conv1", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block1_conv1", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]]}, {"name": "block1_conv2", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block1_conv2", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"name": "block1_pool", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block1_pool", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"name": "block2_conv1", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block2_conv1", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 128, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"name": "block2_conv2", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block2_conv2", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 128, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"name": "block2_pool", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block2_pool", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"name": "block3_conv1", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block3_conv1", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"name": "block3_conv2", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block3_conv2", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"name": "block3_conv3", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block3_conv3", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"name": "block3_pool", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block3_pool", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"name": "block4_conv1", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block4_conv1", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"name": "block4_conv2", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block4_conv2", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"name": "block4_conv3", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block4_conv3", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"name": "block4_pool", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block4_pool", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"name": "block5_conv1", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block5_conv1", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"name": "block5_conv2", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block5_conv2", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"name": "block5_conv3", "config": {"trainable": true, "nb_col": 3, "subsample": [1, 1], "border_mode": "same", "name": "block5_conv3", "b_constraint": null, "W_constraint": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"name": "block5_pool", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block5_pool", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"name": "fc1", "config": {"init": "glorot_uniform", "input_dim": null, "bias": true, "name": "fc1", "b_constraint": null, "W_constraint": null, "output_dim": 1024, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "fc1_dropout", "config": {"p": 0.5, "name": "fc1_dropout", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc1", 0, 0]]]}, {"name": "fc2", "config": {"init": "glorot_uniform", "input_dim": null, "bias": true, "name": "fc2", "b_constraint": null, "W_constraint": null, "output_dim": 512, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["fc1_dropout", 0, 0]]]}, {"name": "fc2_dropout", "config": {"p": 0.5, "name": "fc2_dropout", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc2", 0, 0]]]}, {"name": "fc3", "config": {"init": "glorot_uniform", "input_dim": null, "bias": true, "name": "fc3", "b_constraint": null, "W_constraint": null, "output_dim": 256, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["fc2_dropout", 0, 0]]]}, {"name": "fc3_dropout", "config": {"p": 0.5, "name": "fc3_dropout", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc3", 0, 0]]]}, {"name": "fc4", "config": {"init": "glorot_uniform", "input_dim": null, "bias": true, "name": "fc4", "b_constraint": null, "W_constraint": null, "output_dim": 128, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["fc3_dropout", 0, 0]]]}, {"name": "fc4_dropout", "config": {"p": 0.5, "name": "fc4_dropout", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc4", 0, 0]]]}, {"name": "fc5", "config": {"init": "glorot_uniform", "input_dim": null, "bias": true, "name": "fc5", "b_constraint": null, "W_constraint": null, "output_dim": 64, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["fc4_dropout", 0, 0]]]}, {"name": "fc5_dropout", "config": {"p": 0.5, "name": "fc5_dropout", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc5", 0, 0]]]}, {"name": "fc6", "config": {"init": "glorot_uniform", "input_dim": null, "bias": true, "name": "fc6", "b_constraint": null, "W_constraint": null, "output_dim": 32, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["fc5_dropout", 0, 0]]]}, {"name": "fc6_dropout", "config": {"p": 0.5, "name": "fc6_dropout", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc6", 0, 0]]]}, {"name": "output_layer", "config": {"init": "zero", "input_dim": null, "bias": true, "name": "output_layer", "b_constraint": null, "W_constraint": null, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense", "inbound_nodes": [[["fc6_dropout", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "1.1.2", "class_name": "Model"}