{"keras_version": "1.1.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>_\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "block1_conv1", "class_name": "Convolution2D", "config": {"name": "block1_conv1", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["lambda_1", 0, 0]]]}, {"name": "block1_conv2", "class_name": "Convolution2D", "config": {"name": "block1_conv2", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"name": "block2_conv1", "class_name": "Convolution2D", "config": {"name": "block2_conv1", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 128, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"name": "block2_conv2", "class_name": "Convolution2D", "config": {"name": "block2_conv2", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 128, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"name": "block3_conv1", "class_name": "Convolution2D", "config": {"name": "block3_conv1", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 256, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"name": "block3_conv2", "class_name": "Convolution2D", "config": {"name": "block3_conv2", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 256, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"name": "block3_conv3", "class_name": "Convolution2D", "config": {"name": "block3_conv3", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 256, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"name": "block4_conv1", "class_name": "Convolution2D", "config": {"name": "block4_conv1", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 512, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"name": "block4_conv2", "class_name": "Convolution2D", "config": {"name": "block4_conv2", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 512, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"name": "block4_conv3", "class_name": "Convolution2D", "config": {"name": "block4_conv3", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 512, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"name": "block5_conv1", "class_name": "Convolution2D", "config": {"name": "block5_conv1", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 512, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"name": "block5_conv2", "class_name": "Convolution2D", "config": {"name": "block5_conv2", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 512, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"name": "block5_conv3", "class_name": "Convolution2D", "config": {"name": "block5_conv3", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 512, "border_mode": "same", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf"}, "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"name": "fc1", "class_name": "Dense", "config": {"name": "fc1", "b_regularizer": null, "output_dim": 1024, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "elu"}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "fc1_dropout", "class_name": "Dropout", "config": {"name": "fc1_dropout", "trainable": true, "p": 0.5}, "inbound_nodes": [[["fc1", 0, 0]]]}, {"name": "fc2", "class_name": "Dense", "config": {"name": "fc2", "b_regularizer": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "elu"}, "inbound_nodes": [[["fc1_dropout", 0, 0]]]}, {"name": "fc2_dropout", "class_name": "Dropout", "config": {"name": "fc2_dropout", "trainable": true, "p": 0.5}, "inbound_nodes": [[["fc2", 0, 0]]]}, {"name": "fc3", "class_name": "Dense", "config": {"name": "fc3", "b_regularizer": null, "output_dim": 256, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "elu"}, "inbound_nodes": [[["fc2_dropout", 0, 0]]]}, {"name": "fc3_dropout", "class_name": "Dropout", "config": {"name": "fc3_dropout", "trainable": true, "p": 0.5}, "inbound_nodes": [[["fc3", 0, 0]]]}, {"name": "fc4", "class_name": "Dense", "config": {"name": "fc4", "b_regularizer": null, "output_dim": 128, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "elu"}, "inbound_nodes": [[["fc3_dropout", 0, 0]]]}, {"name": "fc4_dropout", "class_name": "Dropout", "config": {"name": "fc4_dropout", "trainable": true, "p": 0.5}, "inbound_nodes": [[["fc4", 0, 0]]]}, {"name": "fc5", "class_name": "Dense", "config": {"name": "fc5", "b_regularizer": null, "output_dim": 64, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "elu"}, "inbound_nodes": [[["fc4_dropout", 0, 0]]]}, {"name": "fc5_dropout", "class_name": "Dropout", "config": {"name": "fc5_dropout", "trainable": true, "p": 0.5}, "inbound_nodes": [[["fc5", 0, 0]]]}, {"name": "fc6", "class_name": "Dense", "config": {"name": "fc6", "b_regularizer": null, "output_dim": 32, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "elu"}, "inbound_nodes": [[["fc5_dropout", 0, 0]]]}, {"name": "fc6_dropout", "class_name": "Dropout", "config": {"name": "fc6_dropout", "trainable": true, "p": 0.5}, "inbound_nodes": [[["fc6", 0, 0]]]}, {"name": "output_layer", "class_name": "Dense", "config": {"name": "output_layer", "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "zero", "activation": "linear"}, "inbound_nodes": [[["fc6_dropout", 0, 0]]]}], "output_layers": [["output_layer", 0, 0]]}, "class_name": "Model"}