{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["output_layer", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "name": "lambda_1"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 64, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block1_conv1"}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "block1_conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 64, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block1_conv2"}, "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "block1_pool"}, "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 128, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block2_conv1"}, "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 128, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block2_conv2"}, "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "block2_pool"}, "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 256, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block3_conv1"}, "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 256, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block3_conv2"}, "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 256, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block3_conv3"}, "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "block3_pool"}, "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block4_conv1"}, "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block4_conv2"}, "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block4_conv3"}, "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "block4_pool"}, "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block5_conv1"}, "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block5_conv2"}, "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "name": "block5_conv3"}, "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "block5_pool"}, "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["block5_pool", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "elu", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "fc1", "W_constraint": null, "output_dim": 1024}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "fc1"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc1_dropout", "p": 0.5}, "inbound_nodes": [[["fc1", 0, 0]]], "name": "fc1_dropout"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "elu", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "fc2", "W_constraint": null, "output_dim": 512}, "inbound_nodes": [[["fc1_dropout", 0, 0]]], "name": "fc2"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc2_dropout", "p": 0.5}, "inbound_nodes": [[["fc2", 0, 0]]], "name": "fc2_dropout"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "elu", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "fc3", "W_constraint": null, "output_dim": 256}, "inbound_nodes": [[["fc2_dropout", 0, 0]]], "name": "fc3"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc3_dropout", "p": 0.5}, "inbound_nodes": [[["fc3", 0, 0]]], "name": "fc3_dropout"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "elu", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "fc4", "W_constraint": null, "output_dim": 128}, "inbound_nodes": [[["fc3_dropout", 0, 0]]], "name": "fc4"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc4_dropout", "p": 0.5}, "inbound_nodes": [[["fc4", 0, 0]]], "name": "fc4_dropout"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "elu", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "fc5", "W_constraint": null, "output_dim": 64}, "inbound_nodes": [[["fc4_dropout", 0, 0]]], "name": "fc5"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc5_dropout", "p": 0.5}, "inbound_nodes": [[["fc5", 0, 0]]], "name": "fc5_dropout"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "elu", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "fc6", "W_constraint": null, "output_dim": 32}, "inbound_nodes": [[["fc5_dropout", 0, 0]]], "name": "fc6"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc6_dropout", "p": 0.5}, "inbound_nodes": [[["fc6", 0, 0]]], "name": "fc6_dropout"}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "zero", "activity_regularizer": null, "trainable": true, "name": "output_layer", "W_constraint": null, "output_dim": 1}, "inbound_nodes": [[["fc6_dropout", 0, 0]]], "name": "output_layer"}], "name": "model_1"}, "keras_version": "1.1.2"}