{"keras_version": "1.1.2", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "input_1"}}, {"name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"function_type": "lambda", "trainable": true, "arguments": {}, "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>g\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}}, {"name": "block1_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block1_conv1", "bias": true}}, {"name": "block1_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block1_conv2", "bias": true}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "block1_pool", "strides": [2, 2]}}, {"name": "block2_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 128, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block2_conv1", "bias": true}}, {"name": "block2_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 128, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block2_conv2", "bias": true}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "block2_pool", "strides": [2, 2]}}, {"name": "block3_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 256, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block3_conv1", "bias": true}}, {"name": "block3_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 256, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block3_conv2", "bias": true}}, {"name": "block3_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 256, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block3_conv3", "bias": true}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "block3_pool", "strides": [2, 2]}}, {"name": "block4_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block4_conv1", "bias": true}}, {"name": "block4_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block4_conv2", "bias": true}}, {"name": "block4_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block4_conv3", "bias": true}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "block4_pool", "strides": [2, 2]}}, {"name": "block5_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block5_conv1", "bias": true}}, {"name": "block5_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block5_conv2", "bias": true}}, {"name": "block5_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"subsample": [1, 1], "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "name": "block5_conv3", "bias": true}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "block5_pool", "strides": [2, 2]}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "fc1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"activation": "elu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 1024, "trainable": true, "bias": true, "b_regularizer": null, "name": "fc1"}}, {"name": "fc1_dropout", "class_name": "Dropout", "inbound_nodes": [[["fc1", 0, 0]]], "config": {"p": 0.5, "name": "fc1_dropout", "trainable": true}}, {"name": "fc2", "class_name": "Dense", "inbound_nodes": [[["fc1_dropout", 0, 0]]], "config": {"activation": "elu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 512, "trainable": true, "bias": true, "b_regularizer": null, "name": "fc2"}}, {"name": "fc2_dropout", "class_name": "Dropout", "inbound_nodes": [[["fc2", 0, 0]]], "config": {"p": 0.5, "name": "fc2_dropout", "trainable": true}}, {"name": "fc3", "class_name": "Dense", "inbound_nodes": [[["fc2_dropout", 0, 0]]], "config": {"activation": "elu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 256, "trainable": true, "bias": true, "b_regularizer": null, "name": "fc3"}}, {"name": "fc3_dropout", "class_name": "Dropout", "inbound_nodes": [[["fc3", 0, 0]]], "config": {"p": 0.5, "name": "fc3_dropout", "trainable": true}}, {"name": "fc4", "class_name": "Dense", "inbound_nodes": [[["fc3_dropout", 0, 0]]], "config": {"activation": "elu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 128, "trainable": true, "bias": true, "b_regularizer": null, "name": "fc4"}}, {"name": "fc4_dropout", "class_name": "Dropout", "inbound_nodes": [[["fc4", 0, 0]]], "config": {"p": 0.5, "name": "fc4_dropout", "trainable": true}}, {"name": "fc5", "class_name": "Dense", "inbound_nodes": [[["fc4_dropout", 0, 0]]], "config": {"activation": "elu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 64, "trainable": true, "bias": true, "b_regularizer": null, "name": "fc5"}}, {"name": "fc5_dropout", "class_name": "Dropout", "inbound_nodes": [[["fc5", 0, 0]]], "config": {"p": 0.5, "name": "fc5_dropout", "trainable": true}}, {"name": "fc6", "class_name": "Dense", "inbound_nodes": [[["fc5_dropout", 0, 0]]], "config": {"activation": "elu", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 32, "trainable": true, "bias": true, "b_regularizer": null, "name": "fc6"}}, {"name": "fc6_dropout", "class_name": "Dropout", "inbound_nodes": [[["fc6", 0, 0]]], "config": {"p": 0.5, "name": "fc6_dropout", "trainable": true}}, {"name": "output_layer", "class_name": "Dense", "inbound_nodes": [[["fc6_dropout", 0, 0]]], "config": {"activation": "linear", "init": "zero", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 1, "trainable": true, "bias": true, "b_regularizer": null, "name": "output_layer"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["output_layer", 0, 0]]}}